import React from 'react';
import "./index.scss";

const Target = () => {
  return (
    <div className='target-container container'>
      <div className='target-box'>
        <div className='title'>
          <h2>Кому підходить?</h2>
          <p>Усім, хто прагне врешті зрозуміти логіку часових конструкцій і назавжди попрощатися з нав’язливою ідеєю, що англійські часи – це страшний сон! Якщо ви зацікавлені у покращенні свого рівня володіння англійською мовою, прагнете вільно висловлювати свої думки, долаючи страх говоріння іноземною мовою, але у вас, як завжди, дуже обмежений ресурс часу, то цей міні-екскурс по часах саме для вас, адже займе лише один з вікендів у вашому житті. </p>
          <p>Подаруйте собі цю чудову подорож в часі, де ще ніхто не побував! І, повірте, це буде найяскравіша оповідь про вихідні у понеділок на каві-брейку!</p>
        </div>
        <div className='target-btn-box'></div>
      </div>
    </div>
  )
}

export default Target;