import React from 'react';
import "./index.scss";

const Result = () => {
  return (
    <div className='result-container container'>
      <div className='box'>
        <div className='bg'></div>
        <div className='title-box'>
          <h2>Що ви отримаєте після проходження курсу?</h2>
          <ul>
            <li>Знатимете чому на Олімпіаді з логіки перше місце отримала б англійська граматика</li>
            <li>Опануєте усі можливі часові конструкції для побудови висловлювань</li>
            <li>Упевнено систематизуєте ваші знання про граматику і залежні від неї конструкції, що є характерними для різноманітних комунікативних ситуацій</li>
            <li>Отримаєте естетично-приємний, проте, віртуальний досвід спілкування під супроводом неймовірно талановитого викладача</li>
            <li>Матимете чудовий досвід навчання за допомогою застосування сучасних методів, що безумовно сприятиме створенню максимально наближених до реальності мовних ситуацій та атмосфери присутності у автентично-мовному середовищі</li>
          </ul>
          <button>Записатися</button>
        </div>
      </div>
    </div>
  )
}

export default Result;